IDENTIFICATION DIVISION.
PROGRAM-ID. SAMPLE.

PROCEDURE DIVISION.

DISPLAY-DETAILS.
DISPLAY "WELCOME, " NAME
           DISPLAY "YOU ARE " AGE " YEARS OLD"
EXIT.

STOP RUN.
